{"sample_weight_mode": null, "optimizer": {"beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "name": "Adam", "beta_2": 0.9990000128746033, "epsilon": 1e-08}, "loss": "binary_crossentropy", "class_name": "Sequential", "keras_version": "1.0.5", "config": [{"class_name": "Embedding", "config": {"batch_input_shape": [null, 100], "input_dtype": "int32", "dropout": 0.2, "mask_zero": false, "input_length": 100, "output_dim": 128, "input_dim": 39, "trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "W_regularizer": null}}, {"class_name": "LSTM", "config": {"activation": "tanh", "forget_bias_init": "one", "b_regularizer": null, "go_backwards": false, "dropout_U": 0.2, "stateful": false, "consume_less": "cpu", "inner_activation": "hard_sigmoid", "input_dim": 128, "trainable": true, "input_length": null, "return_sequences": false, "unroll": false, "dropout_W": 0.2, "output_dim": 128, "U_regularizer": null, "name": "lstm_1", "init": "glorot_uniform", "W_regularizer": null, "inner_init": "orthogonal"}}, {"class_name": "Dense", "config": {"activation": "linear", "b_regularizer": null, "activity_regularizer": null, "b_constraint": null, "bias": true, "input_dim": null, "name": "dense_1", "output_dim": 1, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "W_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_1", "trainable": true}}]}