{"sample_weight_mode": null, "loss": "binary_crossentropy", "class_name": "Sequential", "optimizer": {"name": "Adam", "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "epsilon": 1e-08, "lr": 0.0010000000474974513}, "keras_version": "1.0.5", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "activity_regularizer": null, "dropout": 0.2, "input_length": 100, "input_dtype": "int32", "output_dim": 128, "input_dim": 39, "mask_zero": false, "W_constraint": null, "trainable": true, "batch_input_shape": [null, 100], "W_regularizer": null, "init": "uniform"}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "U_regularizer": null, "dropout_W": 0.2, "b_regularizer": null, "input_length": null, "output_dim": 128, "input_dim": 128, "stateful": false, "inner_init": "orthogonal", "inner_activation": "hard_sigmoid", "go_backwards": false, "return_sequences": false, "dropout_U": 0.2, "consume_less": "cpu", "forget_bias_init": "one", "trainable": true, "activation": "tanh", "unroll": false, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"name": "dense_1", "activity_regularizer": null, "bias": true, "output_dim": 1, "input_dim": null, "b_constraint": null, "W_constraint": null, "trainable": true, "activation": "linear", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "sigmoid", "trainable": true}}]}